import { httpErrorMessages } from 'portal-base/common/apis/common'

const helpWords = '请创建工单获取帮助'

export const sslMessageMap = {
  400338: '获取父级证书失败，请稍后重试',
  400406: '证书链错误，请修改后重试',
  400411: '同一个主域申请 TrustAsia DV 单域名免费证书有效订单数量最多不能超过 20 个',
  400431: '十分钟内不允许重复创建订单',
  400432: '后付费订单无法直接关闭，请联系您的销售经理或创建工单获取帮助',
  404930: '上传确认函失败，请稍后重试',
  404931: '找不到该产品信息，' + helpWords,
  404932: '普通域名额度有误，' + helpWords,
  404933: '泛域名额度有误，' + helpWords,
  404934: '该订单不属于你，' + helpWords,
  404935: '订单未支付，请先支付',
  404936: '拉取证书链失败，请重试',
  404937: '购买的产品不匹配，' + helpWords,
  404938: '服务器内部错误，请重试',
  404939: '网络错误，请重试',
  404940: '网络错误，请重试',
  404941: 'URL错误，' + helpWords,
  404942: '返回信息请求失败，' + helpWords,
  404943: '服务器内部错误，' + helpWords,
  404945: '下载确认函错误，请稍后重试',
  404946: '服务器内部错误，' + helpWords,
  404959: '关闭订单失败，' + helpWords, // 关闭供应商订单失败
  404951: '关闭订单失败，' + helpWords, // 关闭交易订单失败
  404952: '关闭订单失败，' + helpWords, // 更新父订单状态失败
  400600: '前置订单未完成，请稍后重试',
  400601: '证书已经过期',
  400602: '添加域名信息为空',
  400603: '重颁发订单无法续费',
  400604: '该订单暂时无法续费',
  400605: '提交参数错误，请修改后重试',
  400606: '已有重复订单，请操作原订单，或' + helpWords,
  400607: '域名数量超过订单额度',
  400608: '该订单不能添加域名',
  400609: '该订单不能关闭'
}

export const fusionMessageMap = {
  8001: '域名已经存在',
  8002: '域名已经被他人使用',
  8003: '无效的域名',
  8004: '域名正在删除',
  8005: '无效的源站域名',
  8006: '无效的源站Ip',
  8007: '无效的icp',
  8008: '无效的源站类型',
  8009: '无效的国家',
  8010: '无效的协议',
  8011: '无效的类型',
  8012: '无效的线路',
  8013: '空间不存在',
  8100: '域名冲突',

  40401: '获取统计数据失败',

  400000: '无效输入',
  400001: '无效域名',
  400002: '无效的源站类型',
  400003: '无效的线路平台',
  400004: '无效的覆盖范围',
  400005: '无效的协议',
  400006: '无效的线路Id',
  400007: '域名已经存在',
  400008: '空间不存在',
  400009: '记录不存在',
  400010: '空间已存在',
  400011: '空间数量超过限制',
  400012: '更新pub表失败',
  400013: '重复操作',
  400014: '无效Uid',
  400015: '无效的结果',
  400016: '无效的TaskId',
  400017: '无效的结果描述',
  400018: '无效的Cname',
  400019: '修改源站失败',
  400020: '您使用的加速域名未备案，请使用已备案域名重新创建',

  400021: '无效的Marker',
  400022: '无效的测试URL',
  400023: '无效的Ip',
  400024: '确认源站失败',
  400025: '域名冲突',
  400026: '域名已存在',
  400027: '测试URL已存在',
  400028: '该域名暂不支持修改源站',
  400029: '空间冲突',
  400030: '域名任务处理中',
  400031: '无效的URL',
  400032: '无效的Host',
  400033: '预取URL限制',
  400034: '刷新域名个数超过限制，如有需求，' + helpWords,
  400035: '刷新目录个数超过限制，如有需求，' + helpWords,
  400036: '无效的请求Id',
  400037: 'URL已在队列中，无需重复提交',
  400038: '目录未授权',
  400039: '请求次数过多',
  400040: '无效的源站域名',
  400041: '无效的源站Ip',
  400043: '无效的高级源站配置',
  400045: 'HTTPS 证书或私钥校验失败',
  400049: '该域名在两小时内被删除过，请稍候再试',
  // 在前端没有开始结束时间,
  400080: '无效的日期',
  400081: '无效的日期',
  400082: '无效的日期',
  400083: '生成中日志的任务数不得超过3个',
  400084: '任务进行中',

  400060: '无效的防盗链类型',
  400061: '无效的防盗链值',
  400062: '域名重复',
  400063: '重复创建',
  400064: '不是您的域名',
  400065: '无法切换场景',
  400066: '创建失败',
  400067: '您使用的加速域名已在第三方 CDN 设置过，' + helpWords,
  400068: '场景冲突',
  400085: '无效的日期',
  400201: '请上传有效期≥30天的证书',

  400319: '目前 HTTPS 证书暂不支持 ECC 证书',
  400320: '域名已停用, 不可操作',
  400321: '您的证书还未生效，请确认您的证书生效时间，并在生效后提交',
  400322: '请上传证书有效期≥30天的 HTTPS 证书',
  400323: '您的证书有误，请修改后重试',
  400324: '您的证书有误，请修改后重试',
  400325: '您的证书有误，请修改后重试',
  400326: '证书与域名不匹配，请修改后重试',
  400327: '私钥错误，请修改后重试',
  400328: '私钥错误，请修改后重试',
  400329: '您的证书已过期，请重新提交有效期≥30天的 HTTPS 证书',

  403000: '该空间已经创建了qnssl.com的 HTTPS 域名',
  400307: '该域名暂不支持时间戳防盗链，如需开通使用，请创建工单联系我们',
  400308: '不能同时更改两个 KEY',
  400318: '没有改动 KEY 的值',
  400348: '无效证书通用名称',

  400397: '该域名无法自助升级，' + helpWords, // ErrSameCname,

  400400: '重复创建证书',
  400401: '没有找到证书',
  400402: '该订单未通过CA机构审核，无法提交，请修改后重试',
  400403: '没有找到证书订单',
  400404: '域名验证失败',
  400407: '该域名无法自助升级，' + helpWords, // ErrBandWidthOverFlow

  404001: '没有找到该域名',
  404904: '该域名无法自助升级，' + helpWords, // ErrCNameNotUsed
  404905: '该域名无法自助升级，' + helpWords, // ErrNotedDomain
  404906: '证书错误，请检查证书', // ErrPemDecodeFailed
  404907: '证书解析错误， 请修改后重试', // ErrParseCertificate
  404908: '域名不属于您, 无法进行操作', // ErrNotOwnCert
  404910: '该域名无法自助升级，' + helpWords, // ErrSSLizeCheckCDNConfigsUnmatch
  404911: '无效的路径',
  404912: '无效的正则表达式',
  404913: '北美机房的存储空间，暂时不支持开启图片瘦身', // ErrNaBucketEnableImageSlim,
  404923: '私有空间暂时不支持配置HTTPS 点播平台',

  500000: '内部错误，' + helpWords, // '服务端错误'
  500001: '内部错误，' + helpWords, // '设置回源DNS失败'
  500002: '内部错误，' + helpWords, // '插入数据失败'
  500003: '内部错误，' + helpWords, // '删除失败'
  500004: '内部错误，' + helpWords, // '更新失败'
  500005: '内部错误，' + helpWords, // '查询失败'
  500006: '内部错误，' + helpWords, // '创建DNS失败'
  500007: '内部错误，' + helpWords, // '删除DNS失败'
  500008: '内部错误，' + helpWords, // '创建CDN失败'
  500009: '内部错误，' + helpWords, // '删除CDN失败'
  500010: '内部错误，' + helpWords, // '获取域名失败'
  500011: '内部错误，' + helpWords, // '更新pub表失败'
  500012: '内部错误，' + helpWords, // '获取空间列表失败'
  500013: '内部错误，' + helpWords, // '获取空间域名列表失败'
  500014: '内部错误，' + helpWords, // '获取CNAME记录失败'
  500015: '内部错误，' + helpWords, // '获取域名拥有者失败'
  500016: '内部错误，' + helpWords, // '刷新失败'
  500017: '内部错误，' + helpWords, // '刷新目录失败'
  500018: '内部错误，' + helpWords, // '预取失败'

  500104: '国外空间不支持创建 qnssl 域名',
  500105: '国外空间不支持创建 HTTPS 域名',
  500106: '国外空间的泛子域名的泛域名必须也在国外空间',
  500107: '国外空间的域名不能切换到国内空间',
  500108: '只有源站在国外空间的域名才能切换到国外空间',
  500109: '国外空间不支持国内和全球的域名',

  500215: '服务器错误，请稍后重试', // ErrRetry
  500219: '服务器错误，请稍后重试', // ErrRequestFusionSSLCertServer
  500220: '服务器错误，请稍后重试', // ErrRequestRobotServer

  // 域名冲突临时方案
  400000000: '之前已被创建过',
  400001000: '该域名产生冲突，需要验证这个域名属于你',
  400002000: '没有授权的AKSK，请联系域名服务的管理员',
  400003000: '域名格式不合法',
  400004000: '非Admin用户',
  400005000: '时间戳不合法',
  400006000: '没有icp备案',
  400007000: '域名正在被别的用户找回',
  400008000: '找回文件内容错误',
  400009000: '域名找回频率达到限制',
  400010000: '域名不在找回队列中',
  500000000: '服务端错误',
  500001000: '数据库相关错误'
}

export const errorCodeMsg = {
  ...httpErrorMessages,
  ...sslMessageMap,
  ...fusionMessageMap
}

export type ErrorCodeType = keyof typeof errorCodeMsg
