/**
 * @file common constants of image-style
 * @author zhangheng01 <zhangheng01@qiniu.com>
 */

export const separatorList = ['~', '@', '$', '^', '&', '*', '(', ')', '-', '_', '/', '!',
  '+', '=', '{', '}', '[', ']', '|', ':', ';', '"', "'", ',', '<', '>']

export const separatorTextMap = {
  '-': '中划线',
  _: '下划线',
  '!': '感叹号',
  '/': '斜杠',
  '~': '波浪线',
  '`': '反引号',
  '@': 'at 符',
  '#': '井字符',
  $: '美元符',
  '%': '百分号',
  '^': '插入符',
  '&': 'and 符',
  '*': '星号',
  '+': '加号',
  '=': '等于号',
  '{': '左大括号',
  '}': '右大括号',
  '|': '竖线符',
  ':': '冒号',
  ';': '分号',
  "'": '单引号',
  '"': '双引号',
  '<': '左尖括号',
  '>': '右尖括号',
  ',': '逗号',
  '.': '句号',
  '?': '问号',
  '[': '左中括号',
  ']': '右中括号',
  '(': '左小括号',
  ')': '右小括号',
  '\\': '反斜杠'
}
